MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K22/mcu.h
extern volatile TX2STAbits_t TX2STAbits __at(0xF72);
// bitfield macros
#define _TX2STA_TX9D_POSN                                   0x0
#define _TX2STA_TX9D_POSITION                               0x0
#define _TX2STA_TX9D_SIZE                                   0x1
#define _TX2STA_TX9D_LENGTH                                 0x1
#define _TX2STA_TX9D_MASK                                   0x1
#define _TX2STA_TRMT_POSN                                   0x1
#define _TX2STA_TRMT_POSITION                               0x1
#define _TX2STA_TRMT_SIZE                                   0x1
#define _TX2STA_TRMT_LENGTH                                 0x1
#define _TX2STA_TRMT_MASK                                   0x2
#define _TX2STA_BRGH_POSN                                   0x2
#define _TX2STA_BRGH_POSITION                               0x2
#define _TX2STA_BRGH_SIZE                                   0x1
#define _TX2STA_BRGH_LENGTH                                 0x1
#define _TX2STA_BRGH_MASK                                   0x4
#define _TX2STA_SENDB_POSN                                  0x3
#define _TX2STA_SENDB_POSITION                              0x3
#define _TX2STA_SENDB_SIZE                                  0x1
#define _TX2STA_SENDB_LENGTH                                0x1
#define _TX2STA_SENDB_MASK                                  0x8
#define _TX2STA_SYNC_POSN                                   0x4
#define _TX2STA_SYNC_POSITION                               0x4
#define _TX2STA_SYNC_SIZE                                   0x1
#define _TX2STA_SYNC_LENGTH                                 0x1
#define _TX2STA_SYNC_MASK                                   0x10
#define _TX2STA_TXEN_POSN                                   0x5
#define _TX2STA_TXEN_POSITION                               0x5
#define _TX2STA_TXEN_SIZE                                   0x1
#define _TX2STA_TXEN_LENGTH                                 0x1
#define _TX2STA_TXEN_MASK                                   0x20
#define _TX2STA_TX9_POSN                                    0x6
#define _TX2STA_TX9_POSITION                                0x6
#define _TX2STA_TX9_SIZE                                    0x1
#define _TX2STA_TX9_LENGTH                                  0x1
#define _TX2STA_TX9_MASK                                    0x40
#define _TX2STA_CSRC_POSN                                   0x7
#define _TX2STA_CSRC_POSITION                               0x7
#define _TX2STA_CSRC_SIZE                                   0x1
#define _TX2STA_CSRC_LENGTH                                 0x1
#define _TX2STA_CSRC_MASK                                   0x80
#define _TX2STA_TX9D2_POSN                                  0x0
#define _TX2STA_TX9D2_POSITION                              0x0
#define _TX2STA_TX9D2_SIZE                                  0x1
#define _TX2STA_TX9D2_LENGTH                                0x1
#define _TX2STA_TX9D2_MASK                                  0x1
#define _TX2STA_TRMT2_POSN                                  0x1
#define _TX2STA_TRMT2_POSITION                              0x1
#define _TX2STA_TRMT2_SIZE                                  0x1
#define _TX2STA_TRMT2_LENGTH                                0x1
#define _TX2STA_TRMT2_MASK                                  0x2
#define _TX2STA_BRGH2_POSN                                  0x2
#define _TX2STA_BRGH2_POSITION                              0x2
#define _TX2STA_BRGH2_SIZE                                  0x1
#define _TX2STA_BRGH2_LENGTH                                0x1
#define _TX2STA_BRGH2_MASK                                  0x4
#define _TX2STA_SENDB2_POSN                                 0x3
#define _TX2STA_SENDB2_POSITION                             0x3
#define _TX2STA_SENDB2_SIZE                                 0x1
#define _TX2STA_SENDB2_LENGTH                               0x1
#define _TX2STA_SENDB2_MASK                                 0x8
#define _TX2STA_SYNC2_POSN                                  0x4
#define _TX2STA_SYNC2_POSITION                              0x4
#define _TX2STA_SYNC2_SIZE                                  0x1
#define _TX2STA_SYNC2_LENGTH                                0x1
#define _TX2STA_SYNC2_MASK                                  0x10
#define _TX2STA_TXEN2_POSN                                  0x5
#define _TX2STA_TXEN2_POSITION                              0x5
#define _TX2STA_TXEN2_SIZE                                  0x1
#define _TX2STA_TXEN2_LENGTH                                0x1
#define _TX2STA_TXEN2_MASK                                  0x20
#define _TX2STA_TX92_POSN                                   0x6
#define _TX2STA_TX92_POSITION                               0x6
#define _TX2STA_TX92_SIZE                                   0x1
#define _TX2STA_TX92_LENGTH                                 0x1
#define _TX2STA_TX92_MASK                                   0x40
#define _TX2STA_CSRC2_POSN                                  0x7
#define _TX2STA_CSRC2_POSITION                              0x7
#define _TX2STA_CSRC2_SIZE                                  0x1
#define _TX2STA_CSRC2_LENGTH                                0x1
#define _TX2STA_CSRC2_MASK                                  0x80
#define _TX2STA_TXD82_POSN                                  0x0
#define _TX2STA_TXD82_POSITION                              0x0
#define _TX2STA_TXD82_SIZE                                  0x1
#define _TX2STA_TXD82_LENGTH                                0x1
#define _TX2STA_TXD82_MASK                                  0x1
#define _TX2STA_TX8_92_POSN                                 0x6
#define _TX2STA_TX8_92_POSITION                             0x6
#define _TX2STA_TX8_92_SIZE                                 0x1
#define _TX2STA_TX8_92_LENGTH                               0x1
#define _TX2STA_TX8_92_MASK                                 0x40

// Register: TXREG2
#define TXREG2 TXREG2
extern volatile unsigned char           TXREG2              __at(0xF73);
#ifndef _LIB_BUILD
asm("TXREG2 equ 0F73h");
#endif
// aliases
extern volatile unsigned char           TX2REG              __at(0xF73);
#ifndef _LIB_BUILD
asm("TX2REG equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2REG                 :8;
    };
} TXREG2bits_t;
extern volatile TXREG2bits_t TXREG2bits __at(0xF73);
// bitfield macros
#define _TXREG2_TX2REG_POSN                                 0x0
#define _TXREG2_TX2REG_POSITION                             0x0
#define _TXREG2_TX2REG_SIZE                                 0x8
#define _TXREG2_TX2REG_LENGTH                               0x8
#define _TXREG2_TX2REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX2REG                 :8;
    };
} TX2REGbits_t;
